index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-03 sam. 19:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<title>Sample Stabilization for Tomography Experiments in Presence of Large Plant Uncertainty</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Thomas Dehaeze" />
<link rel="stylesheet" type="text/css" href="css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Sample Stabilization for Tomography Experiments in Presence of Large Plant Uncertainty
<br />
<span class="subtitle">Dehaeze Thomas, Magnin-Mattenet Muriel and Collette Christophe</span>
</h1>
<blockquote>
<p>
<b>Abstract</b>:
</p>

<p>
A new low emittance lattice storage ring is under construction at the ESRF.
In this new instrument, an upgraded end station for ID31 beamline must allow to position the samples along complex trajectories with a nanometer precision.
In order to reach these requirements, samples have to be mounted on high precision stages, combining a capability of large stroke, spin motion, and active rejection of disturbances.
First, the end station will be presented with the associated requirements. However, the precision is limited by thermal expansion and various imperfections that are not actively compensated.
Our approach is to add a Nano Active Stabilization System (NASS) which is composed of a 6DoF Stewart platform and a 6 DoF metrology system.
A 3D model of the end station updated with experimental data is developed.
As the mass of the samples may vary by up to two orders of magnitudes, robust control strategies are required to address such plant uncertainty.
The proposed control strategy are presented and applied on the developed model by conducting time domain simulations of tomography experiment in presence of instrumentation noise and system uncertainty.
</p>
</blockquote>

<div id="outline-container-org0d816de" class="outline-2">
<h2 id="org0d816de">Paper (<a href="paper/paper.pdf">link</a>)</h2>
<div class="outline-text-2" id="text-org0d816de">
<p>
The paper has been created <a href="https://orgmode.org/">Org Mode</a> (generating <a href="https://www.latex-project.org/">LaTeX</a> code) under <a href="https://www.gnu.org/software/emacs/">Emacs</a>.
</p>
</div>
</div>

<div id="outline-container-orgf135447" class="outline-2">
<h2 id="orgf135447">Tikz Figures (<a href="tikz/index.html">link</a>)</h2>
<div class="outline-text-2" id="text-orgf135447">
<p>
All the figures for the paper have been generated using <a href="https://sourceforge.net/projects/pgf/">TikZ</a>.
</p>
</div>
</div>

<div id="outline-container-orgda02440" class="outline-2">
<h2 id="orgda02440">Poster (<a href="poster/poster.pdf">link</a>)</h2>
<div class="outline-text-2" id="text-orgda02440">
<p>
The poster has been created using the <a href="https://www.ctan.org/pkg/tikzposter">tikzposter</a> package for <a href="https://sourceforge.net/projects/latex-beamer/">beamer</a>.
</p>
</div>
</div>

<div id="outline-container-org28dc3a0" class="outline-2">
<h2 id="org28dc3a0">Talk (<a href="talk/talk.pdf">link</a>)</h2>
<div class="outline-text-2" id="text-org28dc3a0">
<p>
This work has been presented at <a href="https://indico.cern.ch/event/680538/">MEDSI 2018</a>.
</p>
</div>
</div>

<div id="outline-container-org7cda347" class="outline-2">
<h2 id="org7cda347">How to cite this paper</h2>
<div class="outline-text-2" id="text-org7cda347">
<p>
To cite this paper use the following bibtex code.
</p>
<div class="org-src-container">
<pre class="src src-bibtex">@inproceedings{dehaeze18_sampl_stabil_for_tomog_exper,
  author =       {Thomas Dehaeze and M. Magnin Mattenet and Christophe Collette},
  title =        {Sample Stabilization For Tomography Experiments In Presence Of
                  Large Plant Uncertainty},
  booktitle =    {MEDSI'18},
  year =         2018,
  number =       10,
  pages =        {153--157},
  doi =          {10.18429/JACoW-MEDSI2018-WEOAMA02},
  url =          {https://doi.org/10.18429/JACoW-MEDSI2018-WEOAMA02},
  address =      {Geneva, Switzerland},
  isbn =         {978-3-95450-207-3},
  language =     {english},
  month =        {Dec},
  publisher =    {JACoW Publishing},
  series =       {Mechanical Engineering Design of Synchrotron Radiation
                  Equipment and Instrumentation},
  venue =        {Paris, France},
}
</pre>
</div>

<p>
You can also use the formatted citation below.
</p>
<blockquote>
<p>
Dehaeze, T., Mattenet, M. M., &amp; Collette, C., Sample Stabilization For Tomography Experiments In Presence Of Large Plant Uncertainty, In MEDSI&rsquo;18 (pp. 153–157) (2018). Geneva, Switzerland
</p>
</blockquote>
</div>
</div>
</div>
</body>
</html>
